app/Models/NoteModel.php

    function callNote($id_note = false)
    {
        if ($id_note === false) {
            return $this->db->table('notes')->get();
        } else {
            return $this->db->table('notes')->getWhere(['id_note' => $id_note]);
---
SELECT *
FROM `notes`
SELECT *
FROM `notes`
WHERE `id_note` = '9'