app/Models/PesanModel.php

SELECT *
FROM `pesan`
---
    function tampilData()
    {
        return $this->db->table('pesan')->get();   //mengambil data objek type