app/Models/RsvpModel.php

SELECT *
FROM `rsvp`
---
    function tampilRsvp($id_tamu = false)
    {
        if ($id_tamu === false) {
            return $this->db->table('rsvp')->get();   //mengambil data objek type